In [1]:
import pandas as pd

In [2]:
my_sereies = pd.Series([5, 6, 7, 8, 9])

In [3]:
my_sereies

0    5
1    6
2    7
3    8
4    9
dtype: int64

In [4]:
my_sereies.index

RangeIndex(start=0, stop=5, step=1)

In [5]:
my_sereies.values

array([5, 6, 7, 8, 9], dtype=int64)

In [6]:
my_sereies[4]

9

In [7]:
my_series2 = pd.Series([5, 6, 7, 8, 9], index = ['a', 'b', 'c', 'd', 'e'])

In [8]:
my_series2

a    5
b    6
c    7
d    8
e    9
dtype: int64

In [9]:
my_series2[['a', 'c', 'd']]

a    5
c    7
d    8
dtype: int64

In [10]:
my_series2[['a', 'd']] = 1

In [11]:
my_series2

a    1
b    6
c    7
d    1
e    9
dtype: int64

In [12]:
my_series2[my_series2 > 3]

b    6
c    7
e    9
dtype: int64

In [13]:
my_series2[my_series2 > 7] * 2

e    18
dtype: int64

In [14]:
my_series3 = pd.Series({'a':5, 'b':6, 'c':7, 'd':8, 'e':9})

In [15]:
my_series3

a    5
b    6
c    7
d    8
e    9
dtype: int64

In [16]:
'd' in my_series3

True

In [17]:
'g' in my_series3

False

In [18]:
my_series3.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [19]:
list(my_series3.index)

['a', 'b', 'c', 'd', 'e']

In [20]:
my_series3.name = 'number'
my_series3.index.name = 'letters'

In [21]:
my_series3

letters
a    5
b    6
c    7
d    8
e    9
Name: number, dtype: int64

In [23]:
my_series3.index = ['A', 'B', 'C', 'D', 'E']

In [24]:
my_series3

A    5
B    6
C    7
D    8
E    9
Name: number, dtype: int64

### DataFrame

In [25]:
df = pd.DataFrame({
    'country':['Kazakhstan', 'Russia', 'Belarus', 'Ukraine'],
    'population':[17.04, 143.5, 9.5, 45.5],
    'square':[2724902, 17125191, 207600, 603628]
})

In [26]:
df

      country  population    square
0  Kazakhstan       17.04   2724902
1      Russia      143.50  17125191
2     Belarus        9.50    207600
3     Ukraine       45.50    603628

In [27]:
df['country']

0    Kazakhstan
1        Russia
2       Belarus
3       Ukraine
Name: country, dtype: object

In [28]:
type(df['country'])

pandas.core.series.Series

In [29]:
df.columns

Index(['country', 'population', 'square'], dtype='object')

In [30]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [31]:
df1 = df

In [32]:
df1

      country  population    square
0  Kazakhstan       17.04   2724902
1      Russia      143.50  17125191
2     Belarus        9.50    207600
3     Ukraine       45.50    603628

In [33]:
df1.index = ['KZ', 'RU', 'BY', 'UA']

In [34]:
df1

       country  population    square
KZ  Kazakhstan       17.04   2724902
RU      Russia      143.50  17125191
BY     Belarus        9.50    207600
UA     Ukraine       45.50    603628

In [35]:
df

       country  population    square
KZ  Kazakhstan       17.04   2724902
RU      Russia      143.50  17125191
BY     Belarus        9.50    207600
UA     Ukraine       45.50    603628

In [36]:
df1.index.name = 'Country Code'

In [37]:
df1

                 country  population    square
Country Code
KZ            Kazakhstan       17.04   2724902
RU                Russia      143.50  17125191
BY               Belarus        9.50    207600
UA               Ukraine       45.50    603628

In [38]:
df1['country']

Country Code
KZ    Kazakhstan
RU        Russia
BY       Belarus
UA       Ukraine
Name: country, dtype: object

In [39]:
df.loc['KZ']

country       Kazakhstan
population         17.04
square           2724902
Name: KZ, dtype: object

In [40]:
df.iloc[0]

country       Kazakhstan
population         17.04
square           2724902
Name: KZ, dtype: object

In [41]:
df.loc[['KZ','RU'], 'population']

Country Code
KZ     17.04
RU    143.50
Name: population, dtype: float64

In [42]:
df.loc['KZ':'RU', :]

                 country  population    square
Country Code
KZ            Kazakhstan       17.04   2724902
RU                Russia      143.50  17125191

In [43]:
df[df.population > 10]

                 country  population    square
Country Code
KZ            Kazakhstan       17.04   2724902
RU                Russia      143.50  17125191
UA               Ukraine       45.50    603628

In [44]:
df[df.population > 10][['country', 'square']]

                 country    square
Country Code
KZ            Kazakhstan   2724902
RU                Russia  17125191
UA               Ukraine    603628

In [45]:
df1.reset_index()

  Country Code     country  population    square
0           KZ  Kazakhstan       17.04   2724902
1           RU      Russia      143.50  17125191
2           BY     Belarus        9.50    207600
3           UA     Ukraine       45.50    603628

In [46]:
df['density'] = df['population'] / df['square']

In [47]:
df

                 country  population    square   density
Country Code
KZ            Kazakhstan       17.04   2724902  0.000006
RU                Russia      143.50  17125191  0.000008
BY               Belarus        9.50    207600  0.000046
UA               Ukraine       45.50    603628  0.000075

In [48]:
del df['density']

In [49]:
df

                 country  population    square
Country Code
KZ            Kazakhstan       17.04   2724902
RU                Russia      143.50  17125191
BY               Belarus        9.50    207600
UA               Ukraine       45.50    603628

In [50]:
df2 = df1.rename(columns={'Country Code':'country_code'})

In [52]:
df1

                 country  population    square
Country Code
KZ            Kazakhstan       17.04   2724902
RU                Russia      143.50  17125191
BY               Belarus        9.50    207600
UA               Ukraine       45.50    603628

In [53]:
df2 = df1.rename(columns={'country':'country1'})

In [54]:
df2

                country1  population    square
Country Code
KZ            Kazakhstan       17.04   2724902
RU                Russia      143.50  17125191
BY               Belarus        9.50    207600
UA               Ukraine       45.50    603628

In [ ]:
pd.read